import { QuestionBox as ReusableQuestionBox } from "@/components/ui/QuestionBox";

const questions = [
  {
    question: "چند روز قبل از پرواز، بلیط هواپیما را بخریم؟",
    answer:
      "امکان رزرو بلیط هواپیما از ماه‌ها قبل وجود دارد. اما گاهی اوقات قیمت بلیط هواپیما در روزهای نزدیک به پرواز ارزان‌تر می‌شود. بنابراین در صورتی که شرایطتان اجازه می‌دهد، رزرو آنلاین بلیط هواپیما را به روزهای نزدیک پرواز موکول کنید. البته اگر قصد سفر در ایام پرسفر نظیر تعطیلات را دارید، باید هر چه زودتر رزرو بلیط هواپیما را انجام دهید.",
  },
  {
    question: "آیا امکان خرید بلیط هواپیما برای نوزاد وجود دارد؟",
    answer:
      "بله، امکان خرید بلیط هواپیما برای نوزادان وجود دارد. نوزادان زیر ۲ سال معمولاً با تخفیف ویژه و بدون صندلی جداگانه سفر می‌کنند.",
  },
  {
    question: "چگونه می‌توانم بلیط هواپیما را کنسل کنم؟",
    answer:
      "برای کنسل کردن بلیط هواپیما می‌توانید از طریق پنل کاربری خود اقدام کنید یا با پشتیبانی تماس بگیرید. شرایط کنسلی بسته به نوع بلیط و ایرلاین متفاوت است.",
  },
];

export function QuestionBox() {
  return <ReusableQuestionBox items={questions} />;
}
